badgeteam/why2025-firmware-ch32v203/main.c
        // Reset timer 3 peripheral
        RCC->APB1PRSTR |= RCC_APB1Periph_TIM2;
        RCC->APB1PRSTR &= ~RCC_APB1Periph_TIM2;

        TIM2->PSC = 0x2000; // Clock prescaler divider
        TIM2->ATRLR = timer2_pwm_cycle_width; // Total PWM cycle width

        TIM2->CHCTLR1 |= TIM_OC2M_2 | TIM_OC2M_1 | TIM_OC2PE; // Enable channel 2

        TIM2->CTLR1 |= TIM_ARPE; // Enable auto-reload of preload

        TIM2->CCER |= TIM_CC2E | TIM_CC2P; // Enable channel 2 output, positive polarity

        timer2_set(0); // Load default target PWM dutycycle

        TIM2->CTLR1 |= TIM_CEN; // Enable timer
}

void timer3_set(uint16_t value) {
    if (value > timer3_pwm_cycle_width) {
        value = timer3_pwm_cycle_width;
    }
    TIM3->CH1CVR = timer3_pwm_cycle_width - value;
    TIM3->SWEVGR |= TIM_UG; // Apply
}

void timer3_init() {
        RCC->APB1PCENR |= RCC_APB1Periph_TIM3; // Enable clock for timer 3
        AFIO->PCFR1 |= AFIO_PCFR1_TIM3_REMAP_PARTIALREMAP; // Partial mapping (PB4 as channel 1)
        funPinMode(pin_display_backlight, GPIO_Speed_10MHz | GPIO_CNF_OUT_PP_AF);

        // Reset timer 3 peripheral
        RCC->APB1PRSTR |= RCC_APB1Periph_TIM3;
        RCC->APB1PRSTR &= ~RCC_APB1Periph_TIM3;

        TIM3->PSC = 0x2000; // Clock prescaler divider
        TIM3->ATRLR = timer3_pwm_cycle_width; // Total PWM cycle width

        TIM3->CHCTLR1 |= TIM_OC1M_2 | TIM_OC1M_1 | TIM_OC1PE; // Enable channel 1

        TIM3->CTLR1 |= TIM_ARPE; // Enable auto-reload of preload

        TIM3->CCER |= TIM_CC1E | TIM_CC1P; // Enable channel 1 output, positive polarity

        timer3_set(255); // Load default target PWM dutycycle

        TIM3->CTLR1 |= TIM_CEN; // Enable timer
}

// RTC timer

#define PWR_CTLR_R2KSTY   ((uint32_t)0x00010000) /* 2K/20K enable flag (standby) */
#define PWR_CTLR_R30KSTY  ((uint32_t)0x00020000) /* 30K RAM enable flag (standby) */
#define PWR_CTLR_R2KVBAT  ((uint32_t)0x00040000) /* 2K/20K RAM enable flag (vbat) */
#define PWR_CTLR_R30KVBAT ((uint32_t)0x00080000) /* 30K RAM enable flag (vbat) */
#define PWR_CTLR_RAMLV    ((uint32_t)0x00100000) /* RAM low voltage mode enable */

void rtc_disable_wp() {
    PWR->CTLR |= PWR_CTLR_DBP;
}

void rtc_enable_wp() {
    PWR->CTLR &= ~PWR_CTLR_DBP;
}

void rtc_enter_config() {
    RTC->CTLRL |= RTC_CTLRL_CNF;
}

void rtc_exit_config() {
    RTC->CTLRL &= (uint16_t) ~((uint16_t)RTC_CTLRL_CNF);
}

void rtc_wait_for_last_task(void) {
    while((RTC->CTLRL & RTC_FLAG_RTOFF) == 0) {}
}

void rtc_wait_for_sync() {
    RTC->CTLRL &= (uint16_t)~RTC_FLAG_RSF;
    while((RTC->CTLRL & RTC_FLAG_RSF) == 0) {}
}

void rtc_set_prescaler(uint32_t value) {
    rtc_enter_config();
    RTC->PSCRH = (value >> 16) & 0xF;
    RTC->PSCRL = value & 0xFFFF;
    rtc_exit_config();
}

uint32_t rtc_get_prescaler() {
    return ((RTC->PSCRH & 0xF) << 16) | RTC->PSCRL;
}

void rtc_set_counter(uint32_t value) {
    rtc_disable_wp();
    rtc_enter_config();
    rtc_wait_for_last_task();
    RTC->CNTH = value >> 16;
    RTC->CNTL = value & 0xFFFF;
    rtc_wait_for_last_task();
    rtc_exit_config();
    rtc_wait_for_last_task();
    rtc_enable_wp();
}

uint32_t rtc_get_counter() {
    uint16_t high1 = RTC->CNTH;
    uint16_t high2 = RTC->CNTH;
    uint16_t low = RTC->CNTL;
    if(high1 != high2) {
        return (((uint32_t)high2 << 16) | RTC->CNTL);
    } else {
        return (((uint32_t)high1 << 16) | low);
    }
}

uint32_t rtc_read_divider() {
    uint32_t tmp = 0x00;
    tmp = ((uint32_t)RTC->DIVH & (uint32_t)0x000F) << 16;
    tmp |= RTC->DIVL;
    return tmp;
}

void rtc_init() {
    RCC->APB1PCENR |= RCC_APB1Periph_PWR | RCC_APB1Periph_BKP;

    bool rtc_not_ready = false;
    rtc_not_ready |= !(RCC->BDCTLR | RCC_LSEON); // If LSE oscillator is not enabled
    rtc_not_ready |= !(RCC->BDCTLR & RCC_LSERDY); // If LSE oscillator is not running
    rtc_not_ready |= !(RCC->BDCTLR | RCC_RTCSEL_0); // If LSE is not selected as clock source
    rtc_not_ready |= !(RCC->BDCTLR | RCC_RTCEN); // If RTC is not enabled
    rtc_not_ready |= !(rtc_get_prescaler() == 32768 / 2); // If RTC is not set to tick once per second

    if (rtc_not_ready) {
        rtc_disable_wp(); // Disable backup domain write protection
        RCC->BDCTLR |= RCC_LSEON; // Enable LSE

        // Wait for LSE oscillator ready
        while (!(RCC->BDCTLR & RCC_LSERDY)) {}

        RCC->BDCTLR |= RCC_RTCSEL_0; // Use LSE oscillator as RTC clock source
        RCC->BDCTLR |= RCC_RTCEN; // Enable RTC

        rtc_wait_for_last_task();
        rtc_wait_for_last_task();
        rtc_set_prescaler(32768 / 2); // 1 tick per second
        rtc_wait_for_last_task();
        rtc_set_counter(0);
        rtc_wait_for_last_task();
        rtc_enable_wp(); // Enable backup domain write protection
    }
}

// Backup registers
uint16_t bkp_read(uint8_t position) {
    switch(position) {
        case 0:  return BKP->DATAR1;
        case 1:  return BKP->DATAR2;
        case 2:  return BKP->DATAR3;
        case 3:  return BKP->DATAR4;
        case 4:  return BKP->DATAR5;
        case 5:  return BKP->DATAR6;
        case 6:  return BKP->DATAR7;
        case 7:  return BKP->DATAR8;
        case 8:  return BKP->DATAR9;
        case 9:  return BKP->DATAR10;
        case 10:  return BKP->DATAR11;
        case 11:  return BKP->DATAR12;
        case 12:  return BKP->DATAR13;
        case 13:  return BKP->DATAR14;
        case 14:  return BKP->DATAR15;
        case 15:  return BKP->DATAR16;
        case 16:  return BKP->DATAR17;
        case 17:  return BKP->DATAR18;
        case 18:  return BKP->DATAR19;
        case 19:  return BKP->DATAR20;
        case 20:  return BKP->DATAR21;
        case 21:  return BKP->DATAR22;
        case 22:  return BKP->DATAR23;
        case 23:  return BKP->DATAR24;
        case 24:  return BKP->DATAR25;
        case 25:  return BKP->DATAR26;
        case 26:  return BKP->DATAR27;
        case 27:  return BKP->DATAR28;
        case 28:  return BKP->DATAR29;
        case 29:  return BKP->DATAR30;
        case 30:  return BKP->DATAR31;
        case 31:  return BKP->DATAR32;
        case 32:  return BKP->DATAR33;
        case 33:  return BKP->DATAR34;
        case 34:  return BKP->DATAR35;
        case 35:  return BKP->DATAR36;
        case 36:  return BKP->DATAR37;
        case 37:  return BKP->DATAR38;
        case 38:  return BKP->DATAR39;
        case 39:  return BKP->DATAR40;
        case 40:  return BKP->DATAR41;
        case 41:  return BKP->DATAR42;
        default: return 0;
    }
}

