badgeteam/why2025-firmware-ch32v203/main.c
void bkp_read_all() {
    for (uint8_t index = 0; index < 42; index++) {
        uint16_t value = bkp_read(index);
        i2c_registers[I2C_REG_BACKUP_0 + index * 2 + 0] = (value >> 0) & 0xFF;
        i2c_registers[I2C_REG_BACKUP_0 + index * 2 + 1] = (value >> 8) & 0xFF;
    }
}

void bkp_write(uint8_t position, uint16_t value) {
    rtc_disable_wp();
    switch(position) {
        case 0:  BKP->DATAR1 = value;
        case 1:  BKP->DATAR2 = value;
        case 2:  BKP->DATAR3 = value;
        case 3:  BKP->DATAR4 = value;
        case 4:  BKP->DATAR5 = value;
        case 5:  BKP->DATAR6 = value;
        case 6:  BKP->DATAR7 = value;
        case 7:  BKP->DATAR8 = value;
        case 8:  BKP->DATAR9 = value;
        case 9:  BKP->DATAR10 = value;
        case 10:  BKP->DATAR11 = value;
        case 11:  BKP->DATAR12 = value;
        case 12:  BKP->DATAR13 = value;
        case 13:  BKP->DATAR14 = value;
        case 14:  BKP->DATAR15 = value;
        case 15:  BKP->DATAR16 = value;
        case 16:  BKP->DATAR17 = value;
        case 17:  BKP->DATAR18 = value;
        case 18:  BKP->DATAR19 = value;
        case 19:  BKP->DATAR20 = value;
        case 20:  BKP->DATAR21 = value;
        case 21:  BKP->DATAR22 = value;
        case 22:  BKP->DATAR23 = value;
        case 23:  BKP->DATAR24 = value;
        case 24:  BKP->DATAR25 = value;
        case 25:  BKP->DATAR26 = value;
        case 26:  BKP->DATAR27 = value;
        case 27:  BKP->DATAR28 = value;
        case 28:  BKP->DATAR29 = value;
        case 29:  BKP->DATAR30 = value;
        case 30:  BKP->DATAR31 = value;
        case 31:  BKP->DATAR32 = value;
        case 32:  BKP->DATAR33 = value;
        case 33:  BKP->DATAR34 = value;
        case 34:  BKP->DATAR35 = value;
        case 35:  BKP->DATAR36 = value;
        case 36:  BKP->DATAR37 = value;
        case 37:  BKP->DATAR38 = value;
        case 38:  BKP->DATAR39 = value;
        case 39:  BKP->DATAR40 = value;
        case 40:  BKP->DATAR41 = value;
        case 41:  BKP->DATAR42 = value;
        default: break;
    }
    rtc_enable_wp();
}

void bkp_write_byte(uint8_t position, uint8_t value) {
    uint16_t register_value = bkp_read(position >> 1);
    if (position & 1) {
        register_value &= 0x00FF;
        register_value |= value << 8;
    } else {
        register_value &= 0xFF00;
        register_value |= value;
    }
    bkp_write(position >> 1, register_value);
}

// I2C write callback
void i2c_write_cb(uint8_t reg, uint8_t length) {
    static uint32_t new_rtc_value = 0;

    while (length > 0) {
        switch(reg) {
            case I2C_REG_DISPLAY_BACKLIGHT_0:
                if (length > 1) break; // Fall through when only LSB register gets written
            case I2C_REG_DISPLAY_BACKLIGHT_1: {
                timer3_set(i2c_registers[I2C_REG_DISPLAY_BACKLIGHT_0] + (i2c_registers[I2C_REG_DISPLAY_BACKLIGHT_1] << 8));
                break;
            }
            case I2C_REG_KEYBOARD_BACKLIGHT_0:
                if (length > 1) break; // Fall through when only LSB register gets written
            case I2C_REG_KEYBOARD_BACKLIGHT_1:
                timer2_set(i2c_registers[I2C_REG_KEYBOARD_BACKLIGHT_0] + (i2c_registers[I2C_REG_KEYBOARD_BACKLIGHT_1] << 8));
                break;
            case I2C_REG_OUTPUT:
                funDigitalWrite(pin_amplifier_enable, i2c_registers[I2C_REG_OUTPUT] & 1);
#if HARDWARE_REV > 1
                funDigitalWrite(pin_camera, i2c_registers[I2C_REG_OUTPUT] & 2);
#endif
                break;
            case I2C_REG_RADIO_CONTROL:
#if OVERRIDE_C6 == false // Ignore radio control register if radio override is active
                funDigitalWrite(pin_c6_enable, ((i2c_registers[I2C_REG_RADIO_CONTROL] >> 0) & 1) ? FUN_HIGH : FUN_LOW);
                funDigitalWrite(pin_c6_boot, ((i2c_registers[I2C_REG_RADIO_CONTROL] >> 1) & 1) ? FUN_HIGH : FUN_LOW);
#endif
                break;
            case I2C_REG_RTC_VALUE_0:
                new_rtc_value &= 0xFFFFFF00;
                new_rtc_value |= i2c_registers[I2C_REG_RTC_VALUE_0];
                break;
            case I2C_REG_RTC_VALUE_1:
                new_rtc_value &= 0xFFFF00FF;
                new_rtc_value |= i2c_registers[I2C_REG_RTC_VALUE_1] << 8;
                break;
            case I2C_REG_RTC_VALUE_2:
                new_rtc_value &= 0xFF00FFFF;
                new_rtc_value |= i2c_registers[I2C_REG_RTC_VALUE_2] << 16;
                break;
            case I2C_REG_RTC_VALUE_3:
                new_rtc_value &= 0x00FFFFFF;
                new_rtc_value |= i2c_registers[I2C_REG_RTC_VALUE_3] << 24;
                rtc_set_counter(new_rtc_value);
                break;
            default:
                if (reg >= I2C_REG_BACKUP_0 && reg <= I2C_REG_BACKUP_83) {
                    bkp_write_byte(reg - I2C_REG_BACKUP_0, i2c_registers[reg]);
                }
                break;
        }
        // Next register
        reg++;
        length--;
    }
}

// I2C read callback
void i2c_read_cb(uint8_t reg) {
    switch(reg) {
        case I2C_REG_KEYBOARD_0:
        case I2C_REG_KEYBOARD_1:
        case I2C_REG_KEYBOARD_2:
        case I2C_REG_KEYBOARD_3:
        case I2C_REG_KEYBOARD_4:
        case I2C_REG_KEYBOARD_5:
        case I2C_REG_KEYBOARD_6:
        case I2C_REG_KEYBOARD_7:
        case I2C_REG_KEYBOARD_8:
            keyboard_interrupt = false; // Clear keyboard interrupt flag
            break;
        case I2C_REG_INPUT:
            input_interrupt = false; // Clear input interrupt flag
            break;
        default:
            break;
    }
}

// ---- PMIC ----

// REG00
void pmic_set_input_current_limit(uint16_t current, bool enable_ilim_pin) {
    const uint8_t reg = 0x00;
    uint8_t value = 0x00;

    if (current < 100) { // Minimum current is 100 mA
        current = 100;
    }
    current -= 100; // Offset is 100 mA

    if (enable_ilim_pin) {
        value |= 0b1000000; // Enable ILIM pin
    }
    if (current >= 1600) {
        current -= 1600;
        value |= 0b100000; // Add 1600 mA
    }
    if (current >= 800) {
        current -= 800;
        value |= 0b10000; // Add 800 mA
    }
    if (current >= 400) {
        current -= 400;
        value |= 0b1000; // Add 400 mA
    }
    if (current >= 200) {
        current -= 200;
        value |= 0b100; // Add 200 mA
    }
    if (current >= 100) {
        current -= 100;
        value |= 0b10; // Add 100 mA
    }
    if (current >= 50) {
        current -= 50;
        value |= 0b1; // Add 50 mA
    }

