badgeteam/why2025-firmware-ch32v203/main.c
    pm_i2c_write_reg(0x6a, reg, &value, 1);
}

// REG02
void pmic_adc_control(bool enable, bool continuous) {
    const uint8_t reg = 0x02;
    uint8_t value = 0;
    pm_i2c_read_reg(0x6a, reg, &value, 1);
    if (enable) {
        value |= (1 << 7);
    } else {
        value &= ~(1 << 7);
    }
    if (continuous) {
        value |= (1 << 6);
    } else {
        value &= ~(1 << 6);
    }
    pm_i2c_write_reg(0x6a, reg, &value, 1);
}

void pmic_ico(bool enable) {
    const uint8_t reg = 0x02;
    uint8_t value = 0;
    pm_i2c_read_reg(0x6a, reg, &value, 1);
    if (enable) {
        value |= (1 << 4);
    } else {
        value &= ~(1 << 4);
    }
    pm_i2c_write_reg(0x6a, reg, &value, 1);
}

// REG03
void pmic_otg(bool enable) {
    const uint8_t reg = 0x03;
    uint8_t value = 0;
    pm_i2c_read_reg(0x6a, reg, &value, 1);
    if (enable) {
        value |= (1 << 5);
    } else {
        value &= ~(1 << 5);
    }
    pm_i2c_write_reg(0x6a, reg, &value, 1);
}


void pmic_set_minimum_system_voltage_limit(uint16_t voltage) {
    // Voltage in mV
    const uint8_t reg = 0x03;
    uint8_t value = 0;
    pm_i2c_read_reg(0x6a, reg, &value, 1);

    value &= 0b11110001; // Mask

    value |= 0b10000000; // Enable battery load

    if (voltage < 3000) { // Minimum voltage is 3V
        voltage = 3000;
    }
    voltage -= 3000; // Offset is 3V

    if (voltage >= 400) {
        voltage -= 400;
        value |= (0b100) << 1; // Add 0.4V
    }
    if (voltage >= 200) {
        voltage -= 200;
        value |= (0b010) << 1; // Add 0.2V
    }
    if (voltage >= 100) {
        voltage -= 100;
        value |= (0b001) << 1; // Add 0.1V
    }

    pm_i2c_write_reg(0x6a, reg, &value, 1);
}

// REG04

void pmic_set_fast_charge_current(uint16_t current, bool en_pumpx) {
    const uint8_t reg = 0x04;
    uint8_t value = 0;

    if (en_pumpx) {
        value |= (1 << 7);
    }

    if (current >= 4096) {
        current -= 4096;
        value |= (1 << 6); // Add 4096mA
    }
    if (current >= 2048) {
        current -= 2048;
        value |= (1 << 5); // Add 2048mA
    }
    if (current >= 1024) {
        current -= 1024;
        value |= (1 << 4); // Add 1024mA
    }
    if (current >= 512) {
        current -= 512;
        value |= (1 << 3); // Add 512mA
    }
    if (current >= 256) {
        current -= 256;
        value |= (1 << 2); // Add 256mA
    }
    if (current >= 128) {
        current -= 128;
        value |= (1 << 1); // Add 128mA
    }
    if (current >= 64) {
        current -= 64;
        value |= (1 << 0); // Add 64mA
    }

    pm_i2c_write_reg(0x6a, reg, &value, 1);
}

// REG06
void pmic_battery_threshold(uint16_t voltage_limit, bool batlowv, bool vrechg) {
    const uint8_t reg = 0x06;
    uint8_t value = 0;

    if (voltage_limit < 3840) {
        voltage_limit = 3840;
    }
    voltage_limit -= 3840; // Offset
    if (voltage_limit > 512) {
        voltage_limit -= 512;
        value |= (1 << 7); // Add 512mA
    }
    if (voltage_limit > 256) {
        voltage_limit -= 256;
        value |= (1 << 6); // Add 256mA
    }
    if (voltage_limit > 128) {
        voltage_limit -= 128;
        value |= (1 << 5); // Add 128mA
    }
    if (voltage_limit > 64) {
        voltage_limit -= 64;
        value |= (1 << 4); // Add 64mA
    }
    if (voltage_limit > 32) {
        voltage_limit -= 32;
        value |= (1 << 3); // Add 32mA
    }
    if (voltage_limit > 16) {
        voltage_limit -= 16;
        value |= (1 << 2); // Add 16mA
    }
    if (batlowv) {
        value |= (1 << 1); // Battery precharge to fast charge threshold: 1 is 3.0v (default), 0 is 2.8v
    }
    if (vrechg) {
        value |= (1 << 0); // Battery recharge threshold offset: 1 is 200mV below VREG, 0 is 100mV below VREG (default)
    }
    pm_i2c_write_reg(0x6a, reg, &value, 1);
}

// REG07
void pmic_watchdog(uint8_t watchdog_setting) {
    const uint8_t reg = 0x07;
    uint8_t value = 0x00;
    pm_i2c_read_reg(0x6a, reg, &value, 1);
    value &= ~(0b00110000);
    value |= (watchdog_setting & 3) << 4; // Watchdog
    pm_i2c_write_reg(0x6a, reg, &value, 1);
}

// REG09
void pmic_power_on() {
    pmic_watchdog(0);
    const uint8_t reg = 0x09;
    uint8_t value = 0x00;
    pm_i2c_read_reg(0x6a, reg, &value, 1);
    value &= (~1 << 5); // Clear BATFET_DIS bit
    pm_i2c_write_reg(0x6a, reg, &value, 1);
}

void pmic_power_off() {
    pmic_watchdog(0);
    const uint8_t reg = 0x09;
    uint8_t value = 0x00;
    pm_i2c_read_reg(0x6a, reg, &value, 1);
    value |= (1 << 5); // Set BATFET_DIS bit
    pm_i2c_write_reg(0x6a, reg, &value, 1);
}

// REG0C
void pmic_read_faults() {
    const uint8_t reg = 0x0C;
    uint8_t value = 0;
    pm_i2c_read_reg(0x6a, reg, &value, 1);

    bool watchdog = (value >> 7) & 1;
    bool boost = (value >> 6) & 1;

    bool chrg_input = ((value >> 4) & 3) == 0b01;
    bool chrg_thermal = ((value >> 4) & 3) == 0b10;
    bool chrg_safety = ((value >> 4) & 3) == 0b11;

    bool batt_ovp = (value >> 3) & 1;

    bool ntc_cold = ((value >> 0) & 3) == 0b01;
    bool ntc_hot = ((value >> 0) & 3) == 0b10;
    bool ntc_boost = (value >> 2) & 1;

    printf("Faults: %s%s%s%s%s%s%s%s%s (%02x)\r\n", watchdog?"WDOG ":"", boost?"BOOST ":"", chrg_input?"CHRG-INPUT ":"", chrg_thermal?"CHRG-THERMAL ":"", chrg_safety ? "CHRG-SAFETY ":"", batt_ovp ? "BATT-OVP ":"", ntc_cold ? "NTC-COLD ":"", ntc_hot ? "NTC-HOT ":"", ntc_boost ? "(boost) ":(ntc_hot || ntc_cold ? "(buck) ":""), value);
}

void pmic_vbus_test() {
    uint8_t reg0b;
    pm_i2c_read_reg(0x6a, 0x0b, &reg0b, 1);
    printf("REG0B: %02x\r\n", reg0b);
}

// REG0E
void pmic_adc_test() {
    const uint8_t reg = 0x0E;
    uint8_t buffer[5] = {0x00, 0x00, 0x00, 0x00, 0x00};
    pm_i2c_read_reg(0x6a, reg, buffer, sizeof(buffer));

    // REG0E
    bool treg = (buffer[0] >> 7) & 1;
    uint16_t vbatt = 2304;
    if ((buffer[0] >> 6) & 1) vbatt += 1280;
    if ((buffer[0] >> 5) & 1) vbatt += 640;
    if ((buffer[0] >> 4) & 1) vbatt += 320;
    if ((buffer[0] >> 3) & 1) vbatt += 160;
    if ((buffer[0] >> 2) & 1) vbatt += 80;
    if ((buffer[0] >> 1) & 1) vbatt += 40;
    if ((buffer[0] >> 0) & 1) vbatt += 20;

    // REG0F
    uint16_t vsys = 2304;
    if ((buffer[1] >> 6) & 1) vsys += 1280;
    if ((buffer[1] >> 5) & 1) vsys += 640;
    if ((buffer[1] >> 4) & 1) vsys += 320;
    if ((buffer[1] >> 3) & 1) vsys += 160;
    if ((buffer[1] >> 2) & 1) vsys += 80;
    if ((buffer[1] >> 1) & 1) vsys += 40;
    if ((buffer[1] >> 0) & 1) vsys += 20;

    // REG10
    uint32_t ts = 21;
    if ((buffer[2] >> 6) & 1) ts += 29760;
    if ((buffer[2] >> 5) & 1) ts += 14880;
    if ((buffer[2] >> 4) & 1) ts += 7440;
    if ((buffer[2] >> 3) & 1) ts += 3720;
    if ((buffer[2] >> 2) & 1) ts += 1860;
    if ((buffer[2] >> 1) & 1) ts += 930;
    if ((buffer[2] >> 0) & 1) ts += 465;

    // REG11
    bool vbus_attached = (buffer[3] >> 7) & 1;
    uint16_t vbus = 2304;
    if ((buffer[3] >> 6) & 1) vbus += 6400;
    if ((buffer[3] >> 5) & 1) vbus += 3200;
    if ((buffer[3] >> 4) & 1) vbus += 1600;
    if ((buffer[3] >> 3) & 1) vbus += 800;
    if ((buffer[3] >> 2) & 1) vbus += 400;
    if ((buffer[3] >> 1) & 1) vbus += 200;
    if ((buffer[3] >> 0) & 1) vbus += 100;

    // REG12
    uint16_t charge_current = 0;
    if ((buffer[4] >> 6) & 1) charge_current += 3200;
    if ((buffer[4] >> 5) & 1) charge_current += 1600;
    if ((buffer[4] >> 4) & 1) charge_current += 800;
    if ((buffer[4] >> 3) & 1) charge_current += 400;
    if ((buffer[4] >> 2) & 1) charge_current += 200;
    if ((buffer[4] >> 1) & 1) charge_current += 100;
    if ((buffer[4] >> 0) & 1) charge_current += 50;

    if (!vbus_attached && vbus == 2304) {
        vbus = 0;
    }

    printf("Treg: %s, Vbatt: %u mV, Vsys: %u mV, TS %lu%%, Vbus: %s %u mV, Ichrg: %u mA (%02x %02x %02x %02x %02x)\r\n", treg ? "Y" : "N", vbatt, vsys, ts / 100, vbus_attached ? "Y" : "N", vbus, charge_current, buffer[0], buffer[1], buffer[2], buffer[3], buffer[4]);
}

